
public class Ex01 {

	public static void main(String[] args) {
		
		// 객체 지향 프로그래밍
		
		// java c# python
		
		// class (클래스) : 객체를 정의해 놓은것, 객체의 설계도
		
		// 속성       ,   행동 으로 이루어진 클래스
		//(변수):필드  (매소드):기능
		
		// object (객체) : 객체 생성( new ***)
		// 속성값을 지정
		
		// 객체지향 프로그래밍의 특징
		//캡슐화(Encapsulation), 추상화(Abstraction), 
		//상속(Inheritance), 다형성(Polymorphism)
		
		//추상화 : -객체에서 공통된 속성과 행위를 추출 ,필요한 정보들만 간추려서 구성
		
		//캡슐화 : 실제 구현 내용을 외부로부터 감추는 기법, 작성된도구들, 
		
		//상속 : 생성되어있는 기존코드를 그대로 재사용하거나 재정의 + 확장
				
		//다형성 : 같은 메소드를 호출 하더라도 객체에 따라 다르게 동작
		// 상위 클래스 받아서 재정리 할때를 '오버라이딩' :메소드 이름 같음, 매개변수 타입 개수도 같음 -> 로직만 달라짐.
		
		//객체 지향 장점
		// 1. 신뢰성, 코드 재사용, 유지보수 용이, 직관적인 코드분석, 생산성 향상.
		
		
		}

}
